NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
/* Copyright (c) 2010 - 2020, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "app_light_ctl.h"

#include <stdlib.h>

/* Application */
#include "log.h"
#include "nrf_mesh_config_examples.h"
#include "light_ctl_mc.h"
#include "light_lightness_mc.h"
#include "light_ctl_utils.h"
#include "list.h"
#include "bearer_event.h"

#include "mesh_app_utils.h"

/** This sample implementation shows how the model behavior requirements of the CTL Setup server can
 * be implemented.
 */

#define CTL_ADDITIONAL_PUBLISH_START_MARGIN_MS      (1500)
#define CTL_ADDITIONAL_PUBLISH_INTERVAL_MS          (1000)

#define APP_CTL_TRANSITION_SET APP_TRANSITION_TYPE_SET
#define APP_CTL_TRANSITION_DELTA_SET APP_TRANSITION_TYPE_DELTA_SET
#define APP_CTL_TRANSITION_MOVE_SET APP_TRANSITION_TYPE_MOVE_SET

#define CHECK_INVALID_TEMPERATURE_RANGE(__range)                        \
    if ((__range.temperature32_range_min == light_ctl_utils_temperature_to_temperature32(LIGHT_CTL_TEMPERATURE_UNKNOWN)) || \
        (__range.temperature32_range_max == light_ctl_utils_temperature_to_temperature32(LIGHT_CTL_TEMPERATURE_UNKNOWN))) \
    {                                                                   \
        __LOG(LOG_SRC_APP, LOG_LEVEL_WARN, "Unknown Temperature in CTL range\n"); \
    }

static list_node_t * mp_app_light_ctl_head;
static bearer_event_flag_t m_transition_abort_flag;

/* Forward declarations */
static void transition_parameters_set(app_light_ctl_setup_server_t * p_app,
                                      int32_t delta,
                                      const model_transition_t * p_in_transition,
                                      app_transition_type_t transition_type);

static void ctl_state_set_cb(const light_ctl_setup_server_t * p_self,
                             const access_message_rx_meta_t * p_meta,
                             const light_ctl_set_params_t * p_in,
                             const model_transition_t * p_in_transition,
                             light_ctl_status_params_t * p_out);

static void ctl_state_get_cb(const light_ctl_setup_server_t * p_self,
                             const access_message_rx_meta_t * p_meta,
                             light_ctl_status_params_t * p_out);

static void ctl_state_temperature32_set_cb(const light_ctl_setup_server_t * p_self,
                                           const access_message_rx_meta_t * p_meta,
                                           const light_ctl_temperature_set_params_t * p_in,
                                           const model_transition_t * p_in_transition,
                                           light_ctl_temperature_status_params_t * p_out);

static void ctl_state_temperature32_get_cb(const light_ctl_setup_server_t * p_self,
                                           const access_message_rx_meta_t * p_meta,
                                           light_ctl_temperature_status_params_t * p_out);

static void ctl_state_default_set_cb(const light_ctl_setup_server_t * p_self,
                                     const access_message_rx_meta_t * p_meta,
                                     const light_ctl_default_set_params_t * p_in,
                                     light_ctl_default_status_params_t * p_out);

static void ctl_state_default_get_cb(const light_ctl_setup_server_t * p_self,
                                     const access_message_rx_meta_t * p_meta,
                                     light_ctl_default_status_params_t * p_out);

static void ctl_state_range_set_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   const light_ctl_temperature_range_set_params_t * p_in,
                                   light_ctl_temperature_range_status_params_t * p_out);

static void ctl_state_range_get_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   light_ctl_temperature_range_status_params_t * p_out);

