NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
static void ctl_state_move_set_cb(const light_ctl_setup_server_t * p_self,
                                  const access_message_rx_meta_t * p_meta,
                                  const light_ctl_temperature_move_set_params_t * p_in,
                                  const model_transition_t * p_in_transition,
                                  light_ctl_temperature_status_params_t * p_out);

static void ctl_state_delta_set_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   const light_ctl_temperature_delta_set_params_t * p_in,
                                   const model_transition_t * p_in_transition,
                                   light_ctl_temperature_status_params_t * p_out);

/**** end of callback declarations ****/

static const light_ctl_setup_server_callbacks_t ctl_setup_srv_cbs =
{
    .light_ctl_cbs.set_cb = ctl_state_set_cb,
    .light_ctl_cbs.get_cb = ctl_state_get_cb,
    .light_ctl_cbs.temperature32_set_cb = ctl_state_temperature32_set_cb,
    .light_ctl_cbs.temperature32_get_cb = ctl_state_temperature32_get_cb,
    .light_ctl_cbs.temperature32_range_set_cb = ctl_state_range_set_cb,
    .light_ctl_cbs.temperature32_range_get_cb = ctl_state_range_get_cb,
    .light_ctl_cbs.default_set_cb = ctl_state_default_set_cb,
    .light_ctl_cbs.default_get_cb = ctl_state_default_get_cb,
    .light_ctl_cbs.move_set_cb = ctl_state_move_set_cb,
    .light_ctl_cbs.delta_set_cb = ctl_state_delta_set_cb
};

static int32_t ctl_state_delta_max_compute(app_light_ctl_setup_server_t * p_app,
                                           uint32_t initial_present_temperature32,
                                           uint32_t target_temperature32,
                                           int16_t initial_present_delta_uv,
                                           int16_t target_delta_uv)
{
    int32_t temp_delta;
    int32_t duv_delta;

    /* Compute which is the bigest delta, and return it */
    temp_delta = (int32_t)light_ctl_utils_temperature32_to_temperature(target_temperature32) -
                 (int32_t)light_ctl_utils_temperature32_to_temperature(initial_present_temperature32);
    duv_delta = target_delta_uv - initial_present_delta_uv;

    return (abs(temp_delta) > abs(duv_delta) ? temp_delta : duv_delta);
}

/***** CTL model interface callbacks ****/

static void ctl_state_get_cb(const light_ctl_setup_server_t * p_self,
                             const access_message_rx_meta_t * p_meta,
                             light_ctl_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    uint16_t lightness;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    /* Requirement: Provide the current value of some of the CTL composite state */
    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_app->p_app_ll->app_light_lightness_get_cb(p_app->p_app_ll, &lightness);
    p_out->present_lightness = lightness;
    p_out->target_lightness = p_app->p_app_ll->state.target_lightness;
    p_out->present_temperature32 = present_ctl_state.temperature32;
    p_out->target_temperature32 = p_app->state.target_temperature32;
    /* the ctl_status_params doesn't do delta_uv, so it is unused from the present_ctl_state */

    /* Requirement: Report remaining time during processing of SET or DELTA SET,
     *              Report zero/unknown transition time during processing of MOVE. */
    if (p_params->transition_type == APP_CTL_TRANSITION_MOVE_SET)
    {
        p_out->remaining_time_ms = (p_params->transition_time_ms == 0) ? 0 : MODEL_TRANSITION_TIME_UNKNOWN;
    }
    else
    {
        p_out->remaining_time_ms = app_transition_remaining_time_get(&p_app->state.transition);
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_DBG1,
      "GET CTL: pr L: %d T: %d   tgt L: %d T: %d  rem-tt: %d ms req-delta: %d \n",
      p_out->present_lightness,
      light_ctl_utils_temperature32_to_temperature(p_out->present_temperature32),
      p_out->target_lightness,
      light_ctl_utils_temperature32_to_temperature(p_out->target_temperature32),
      p_out->remaining_time_ms,
      p_params->required_delta);
}

static void ctl_state_set_cb(const light_ctl_setup_server_t * p_self,
                             const access_message_rx_meta_t * p_meta,
                             const light_ctl_set_params_t * p_in,
                             const model_transition_t * p_in_transition,
                             light_ctl_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    uint32_t transition_time_ms;
    light_lightness_set_params_t ll_in;
    light_lightness_status_params_t ll_out;
    light_lightness_setup_server_state_cbs_t * p_ll_srv_cbs;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* Set a module flag to let the code know there is a CTL state set occurring */
    p_app->ctl_state_set_active = true;

    /* First, call the light lightness mid app to do the lightness portion of the CTL state */
    ll_in.lightness = p_in->lightness;
    ll_in.tid = p_in->tid;

    p_ll_srv_cbs = (light_lightness_setup_server_state_cbs_t *)
        &(p_app->p_app_ll->light_lightness_setup_server.settings.p_callbacks->light_lightness_cbs);
    p_ll_srv_cbs->set_cb(&p_app->p_app_ll->light_lightness_setup_server, p_meta, &ll_in,
                         p_in_transition, &ll_out);

    /* Process the temperature and delta UV states (CTL specific - no lightness involved) */
    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_app->state.target_temp32_snapshot = p_in->temperature32;
    p_app->state.target_duv_snapshot = p_in->delta_uv;
    p_app->state.init_present_temp32_snapshot = p_app->state.present_temperature32;
    p_app->state.init_present_duv_snapshot = p_app->state.present_delta_uv;

