NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
    ERROR_CHECK(light_ctl_mc_temperature32_state_set(p_self->state.handle, p_app->state.target_temp32_snapshot));
    ERROR_CHECK(light_ctl_mc_delta_uv_state_set(p_self->state.handle, p_app->state.target_duv_snapshot));

    /* If this is first time since boot, set all of the values, otherwise, check which values to set */
    if (!p_self->state.initialized || (present_ctl_state.temperature32 != p_in->temperature32) ||
        (present_ctl_state.delta_uv != p_in->delta_uv))
    {
        int32_t delta = ctl_state_delta_max_compute(p_app, present_ctl_state.temperature32,
                                                    p_app->state.target_temp32_snapshot,
                                                    present_ctl_state.delta_uv,
                                                    p_app->state.target_duv_snapshot);
        transition_parameters_set(p_app, delta, p_in_transition, APP_CTL_TRANSITION_SET);

        transition_time_ms = p_params->transition_time_ms;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
              "CTL SET: target lightness: %d temperature: %d duv: %d delay: %d  tt: %d  req-delta: %d \n",
              p_in->lightness,
              light_ctl_utils_temperature32_to_temperature(p_in->temperature32),
              p_in->delta_uv,
              p_app->state.transition.delay_ms,
              p_params->transition_time_ms,
              p_params->required_delta);

        app_transition_trigger(&p_app->state.transition);
    }
    else
    {
        transition_time_ms = 0;
    }
    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_lightness = ll_out.present_lightness;
        p_out->target_lightness  = ll_out.target_lightness;
        p_out->present_temperature32 = p_app->state.present_temperature32;
        p_out->target_temperature32 = p_app->state.target_temp32_snapshot;
        p_out->remaining_time_ms = transition_time_ms;
    }
}

static void ctl_state_temperature32_get_cb(const light_ctl_setup_server_t * p_self,
                                           const access_message_rx_meta_t * p_meta,
                                           light_ctl_temperature_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    light_ctl_temperature_range_set_params_t range_set;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    /* Requirement: Provide the current value of some of the CTL composite state */
    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_out->present_temperature32 = present_ctl_state.temperature32;
    p_out->present_delta_uv = present_ctl_state.delta_uv;
    p_out->target_delta_uv = p_app->state.target_delta_uv;
    /* the ctl_status_params doesn't do lightness, so it is unused from the present_ctl_state */

    /* Requirement: Report remaining time during processing of SET or DELTA SET,
     *              Report zero/unknown transition time during processing of MOVE. */
    if (p_params->transition_type == APP_CTL_TRANSITION_MOVE_SET)
    {
        ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_self->state.handle, &range_set));
        /* Insert values as expected in level status message */
        p_out->target_temperature32 =
            p_app->state.target_temperature32 == range_set.temperature32_range_max ? INT16_MAX :
                                                 INT16_MIN;
        /* Response to Move Set message is sent with unknown transition time value, if given
         * transition time is non-zero. */
        p_out->remaining_time_ms = (p_params->transition_time_ms == 0 || p_params->required_delta == 0) ?
                                    0 : MODEL_TRANSITION_TIME_UNKNOWN;
    }
    else
    {
        p_out->target_temperature32 = p_app->state.target_temperature32;
        p_out->remaining_time_ms = app_transition_remaining_time_get(&p_app->state.transition);
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "GET Temp: pr: %d tgt: %d tt: %d\n",
          light_ctl_utils_temperature32_to_temperature(p_out->present_temperature32),
          light_ctl_utils_temperature32_to_temperature(p_out->target_temperature32),
          p_out->remaining_time_ms);
}

static void ctl_state_temperature32_set_cb(const light_ctl_setup_server_t * p_self,
                                           const access_message_rx_meta_t * p_meta,
                                           const light_ctl_temperature_set_params_t * p_in,
                                           const model_transition_t * p_in_transition,
                                           light_ctl_temperature_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    uint32_t transition_time_ms;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    /* Set a module flag to indicate that CTL Temperature state set is in progress. */
    p_app->ctl_temperature_state_set_active = true;

    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);

    p_app->state.target_temp32_snapshot = p_in->temperature32;
    p_app->state.target_duv_snapshot = p_in->delta_uv;
    p_app->state.init_present_temp32_snapshot = p_app->state.present_temperature32;
    p_app->state.init_present_duv_snapshot = p_app->state.present_delta_uv;


    ERROR_CHECK(light_ctl_mc_temperature32_state_set(p_self->state.handle, p_app->state.target_temp32_snapshot));
    ERROR_CHECK(light_ctl_mc_delta_uv_state_set(p_self->state.handle, p_app->state.target_duv_snapshot));

    /* If this is first time since boot, set all of the values, otherwise, check which values to set */
    if (!p_self->state.initialized || (present_ctl_state.temperature32 != p_in->temperature32) ||
        (present_ctl_state.delta_uv != p_in->delta_uv))
    {
        int32_t delta = ctl_state_delta_max_compute(p_app, present_ctl_state.temperature32,
                                                    p_app->state.target_temp32_snapshot,
                                                    present_ctl_state.delta_uv,
                                                    p_app->state.target_duv_snapshot);
        transition_parameters_set(p_app, delta, p_in_transition, APP_CTL_TRANSITION_SET);

