NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
        transition_time_ms = p_params->transition_time_ms;
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO,
              "Temp SET: target temperature: %d  duv: %d,  delay: %d  tt: %d  req-delta: %d \n",
              light_ctl_utils_temperature32_to_temperature(p_in->temperature32),
              p_in->delta_uv,
              p_app->state.transition.delay_ms,
              p_params->transition_time_ms,
              p_params->required_delta);

        app_transition_trigger(&p_app->state.transition);
    }
    else
    {
        transition_time_ms = 0;
    }

    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_temperature32 = p_app->state.present_temperature32;
        p_out->target_temperature32 = p_app->state.target_temp32_snapshot;
        p_out->present_delta_uv = p_app->state.present_delta_uv;
        p_out->target_delta_uv = p_app->state.target_duv_snapshot;
        p_out->remaining_time_ms = transition_time_ms;
    }
}

static void ctl_state_default_get_cb(const light_ctl_setup_server_t * p_self,
                                     const access_message_rx_meta_t * p_meta,
                                     light_ctl_default_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);

    /* Requirement: Provide the current value of the CTL default composite state */
    /* The default is a stored composite state. No callback to the top app is required.*/
    ERROR_CHECK(light_lightness_mc_default_state_get(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                     &p_out->lightness));
    ERROR_CHECK(light_ctl_mc_default_temperature32_state_get(p_self->state.handle, &p_out->temperature32));
    ERROR_CHECK(light_ctl_mc_default_delta_uv_state_get(p_self->state.handle, (int16_t *) &p_out->delta_uv));
}

static void ctl_state_default_set_cb(const light_ctl_setup_server_t * p_self,
                                     const access_message_rx_meta_t * p_meta,
                                     const light_ctl_default_set_params_t * p_in,
                                     light_ctl_default_status_params_t * p_out)
{
    light_ctl_default_status_params_t default_status;
    app_light_ctl_setup_server_t * p_app;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);

    /* Update internal representation of default value. */
    ERROR_CHECK(light_lightness_mc_default_state_set(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                     p_in->lightness));
    ERROR_CHECK(light_ctl_mc_default_temperature32_state_set(p_self->state.handle, p_in->temperature32));
    ERROR_CHECK(light_ctl_mc_default_delta_uv_state_set(p_self->state.handle, p_in->delta_uv));

    ERROR_CHECK(light_lightness_mc_default_state_get(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                     &default_status.lightness));
    ERROR_CHECK(light_ctl_mc_default_temperature32_state_get(p_self->state.handle, &default_status.temperature32));
    ERROR_CHECK(light_ctl_mc_default_delta_uv_state_get(p_self->state.handle, (int16_t *) &default_status.delta_uv));

    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) light_ctl_server_default_status_publish(&p_self->ctl_srv, &default_status);

    if (p_out != NULL)
    {
        /* Prepare response */
        *p_out = default_status;
    }
}

static void ctl_state_range_get_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   light_ctl_temperature_range_status_params_t * p_out)
{
    light_ctl_temperature_range_set_params_t range_set;

    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_self->state.handle, &range_set));
    p_out->status_code = LIGHT_CTL_RANGE_STATUS_GOOD;
    p_out->temperature32_range_min = range_set.temperature32_range_min;
    p_out->temperature32_range_max = range_set.temperature32_range_max;
    /* The CTL server can't function if the temperature is unknown - check for unknown value */
    CHECK_INVALID_TEMPERATURE_RANGE(range_set);
}

static void ctl_state_range_set_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   const light_ctl_temperature_range_set_params_t * p_in,
                                   light_ctl_temperature_range_status_params_t * p_out)
{
    light_ctl_temperature_range_status_params_t range;
    light_ctl_temperature_range_set_params_t range_set;

    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_self->state.handle, &range_set));

    /* The CTL server can't function if the temperature is unknown - check for unknown value */
    CHECK_INVALID_TEMPERATURE_RANGE(range_set);

    /* Range min and range max give the CTL Range state of the CTL Server */
    range.status_code = LIGHT_CTL_RANGE_STATUS_GOOD;
    range.temperature32_range_min = range_set.temperature32_range_min;
    range.temperature32_range_max = range_set.temperature32_range_max;

    /* Determine if the message requires a Range state update. */
    if (p_in->temperature32_range_min < light_ctl_utils_temperature_to_temperature32(LIGHT_CTL_DEFAULT_ALLOWED_TEMPERATURE_MIN))
    {
        range.status_code = LIGHT_CTL_RANGE_STATUS_CANNOT_SET_MIN_RANGE;
        /* The message does not require a Range state update */
    }

    if (p_in->temperature32_range_max > light_ctl_utils_temperature_to_temperature32(LIGHT_CTL_DEFAULT_ALLOWED_TEMPERATURE_MAX))
    {
        range.status_code = LIGHT_CTL_RANGE_STATUS_CANNOT_SET_MAX_RANGE;
        /* The message does not require a Range state update */
    }

    if (range.status_code == LIGHT_CTL_RANGE_STATUS_GOOD)
    {
        /* The range values are valid.
         * The message requires a Range state update. */
        range.temperature32_range_min = p_in->temperature32_range_min;
        range.temperature32_range_max = p_in->temperature32_range_max;

        range_set.temperature32_range_min = p_in->temperature32_range_min;
        range_set.temperature32_range_max = p_in->temperature32_range_max;
        ERROR_CHECK(light_ctl_mc_temperature32_range_state_set(p_self->state.handle, &range_set));

