NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
        /* Ignore status, as publish may fail due to several reasons and it is ok. */
        (void) light_ctl_server_temperature_range_status_publish(&p_self->ctl_srv, &range);
    }

    if (p_out)
    {
        /* Prepare response */
        *p_out = range;
    }
}

/* The delta and move functions are called when a level client sends the associated message to
 * change the temperature state of the CTL state (The lightness and delta UV parts of the CTL state
 * are untouched) */
static void ctl_state_delta_set_cb(const light_ctl_setup_server_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   const light_ctl_temperature_delta_set_params_t * p_in,
                                   const model_transition_t * p_in_transition,
                                   light_ctl_temperature_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    int64_t delta32;
    int64_t target_temperature32;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    NRF_MESH_ASSERT(p_app != NULL && p_in != NULL);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    p_app->ctl_temperature_state_set_active = true;

    p_app->state.new_tid = model_transaction_is_new(&p_app->light_ctl_setup_srv.ctl_srv.tid_tracker);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "tid: %d %s\n", p_in->tid, p_app->state.new_tid ?
          "New TID" : "Same TID, cumulative delta set");

    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);

    delta32 = SCALE_UP((int64_t)p_in->delta_temperature, T32_SCALE_FACTOR);

    /* If delta is too large, target value should get clipped to range limits */
    light_ctl_temperature_range_set_params_t range_set;
    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_self->state.handle, &range_set));

    if (p_app->state.new_tid)
    {
        p_app->state.init_present_temp32_snapshot = p_app->state.present_temperature32;
        p_app->state.init_present_duv_snapshot = p_app->state.present_delta_uv;
    }
    target_temperature32 = p_app->state.new_tid ?
                           present_ctl_state.temperature32 + delta32 :
                           p_app->state.initial_present_temperature32 + delta32;

    p_app->state.target_temp32_snapshot =
        target_temperature32 > (int64_t)range_set.temperature32_range_max ? range_set.temperature32_range_max :
        target_temperature32 < (int64_t)range_set.temperature32_range_min ? range_set.temperature32_range_min :
        target_temperature32;

    transition_parameters_set(p_app, p_in->delta_temperature, p_in_transition, APP_CTL_TRANSITION_DELTA_SET);

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Delta SET: delta: %d  delay: %d  tt: %d\n",
          p_in->delta_temperature, p_app->state.transition.delay_ms,
          p_params->transition_time_ms);

    app_transition_trigger(&p_app->state.transition);

    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_temperature32 = p_app->state.present_temperature32;
        p_out->target_temperature32 = p_app->state.target_temp32_snapshot;
        p_out->remaining_time_ms = p_params->transition_time_ms;
    }
}

static void ctl_state_move_set_cb(const light_ctl_setup_server_t * p_self,
                                  const access_message_rx_meta_t * p_meta,
                                  const light_ctl_temperature_move_set_params_t * p_in,
                                  const model_transition_t * p_in_transition,
                                  light_ctl_temperature_status_params_t * p_out)
{
    app_light_ctl_setup_server_t * p_app;
    light_ctl_temperature_range_set_params_t range_set;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;

    p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, light_ctl_setup_srv, p_self);
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    p_app->ctl_temperature_state_set_active = true;
    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_app->state.present_temperature32 = present_ctl_state.temperature32;
    p_app->state.present_delta_uv = present_ctl_state.delta_uv;

    /* Requirement: For the status message: The target temperature state is the upper limit of
     * the temperature state when the transition speed is positive, or the lower limit of the
     * temperature state when the transition speed is negative. */
    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_self->state.handle, &range_set));
    transition_parameters_set(p_app, (int32_t)p_in->delta_temperature, p_in_transition,
                              APP_CTL_TRANSITION_MOVE_SET);
    if (p_in->delta_temperature > 0 &&
        p_app->state.transition.requested_params.transition_time_ms > 0)
    {
        p_app->state.target_temp32_snapshot = range_set.temperature32_range_max;
    }
    else if (p_in->delta_temperature < 0 &&
             p_app->state.transition.requested_params.transition_time_ms > 0)
    {
        p_app->state.target_temp32_snapshot = range_set.temperature32_range_min;
    }
    else
    {
        p_app->state.target_temp32_snapshot = p_app->state.present_temperature32;
    }

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "MOVE SET: delta: %d  delay: %d  tt: %d\n",
          p_in->delta_temperature, p_app->state.transition.delay_ms,
          p_params->transition_time_ms);
    app_transition_trigger(&p_app->state.transition);

    /* Prepare response */
    if (p_out != NULL)
    {
        p_out->present_temperature32 = p_app->state.present_temperature32;
        /* Insert values as expected in level status message for Move Set */
        p_out->target_temperature32 =
            p_app->state.target_temp32_snapshot == range_set.temperature32_range_max ? UINT32_MAX : 0;
        /* Response to Move Set message is sent with unknown transition time value, if given
         * transition time is non-zero. */
        p_out->remaining_time_ms = (p_params->transition_time_ms == 0 || p_in->delta_temperature == 0) ?
                                    0 : MODEL_TRANSITION_TIME_UNKNOWN;
    }
}

