NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
static uint32_t app_ctl_setup_server_init(app_light_ctl_setup_server_t * p_app, uint8_t element_index)
{
    uint32_t status = NRF_ERROR_INTERNAL;
    light_ctl_setup_server_t * p_s_server;

    p_s_server = &p_app->light_ctl_setup_srv;

    /* Initialize the CTL Setup server callback structure. */
    p_s_server->settings.p_callbacks = &ctl_setup_srv_cbs;

    /* Set the default state (initialize flash). */
    status = light_ctl_mc_open(&p_s_server->state.handle);
    if (status != NRF_SUCCESS)
    {
        return status;
    }
    p_s_server->state.initialized = false;

    return light_ctl_setup_server_init(p_s_server, &p_app->p_app_ll->light_lightness_setup_server, element_index);
}

static uint32_t ctl_publish(app_light_ctl_setup_server_t * p_app, uint32_t remaining_time_ms)
{
    light_ctl_status_params_t publication_data;
    light_ctl_temperature_status_params_t temp_publication_data;
    light_ctl_server_t * p_ctl_srv;
    light_ctl_temperature_server_t * p_ctl_temperature_srv;
    uint32_t status1 = NRF_SUCCESS;
    uint32_t status2;
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    uint32_t ll_remaining_time = 0;
    uint16_t lightness;

    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_app->p_app_ll->app_light_lightness_get_cb(p_app->p_app_ll, &lightness);

    if (!p_app->ctl_temperature_state_set_active)
    {
        /* Calculate how much time is remaining for light lightness (if any) */
        if (app_transition_ongoing_get(&p_app->p_app_ll->state.transition)->transition_time_ms > 0)
        {
            ll_remaining_time = app_transition_remaining_time_get(&p_app->p_app_ll->state.transition);
        }

        if (ll_remaining_time == 0)
        {
            /* Lightness is not transitioning, so use the provided time */
            publication_data.remaining_time_ms = remaining_time_ms;
        }
        else
        {
            /* Lightness isn't done transitioning, so use the longer of the 2 transition times */
            publication_data.remaining_time_ms = MAX(remaining_time_ms, ll_remaining_time);
        }
        /* Either a lightness or a CTL command came in - do a ctl status.  Temperature-specific
         * commands don't need a ctl status publish */
        publication_data.present_lightness = lightness;
        publication_data.present_temperature32 = present_ctl_state.temperature32;
        publication_data.target_lightness = p_app->p_app_ll->state.target_lightness;
        publication_data.target_temperature32 = p_app->state.target_temperature32;

        p_ctl_srv = &p_app->light_ctl_setup_srv.ctl_srv;
        status1 = light_ctl_server_status_publish(p_ctl_srv, &publication_data);
    }

    temp_publication_data.present_temperature32 = present_ctl_state.temperature32;
    temp_publication_data.present_delta_uv = present_ctl_state.delta_uv;
    temp_publication_data.target_temperature32 = p_app->state.target_temperature32;
    temp_publication_data.target_delta_uv = p_app->state.target_delta_uv;
    temp_publication_data.remaining_time_ms = remaining_time_ms;

    p_ctl_temperature_srv = &p_app->light_ctl_setup_srv.ctl_temperature_srv;
    status2 = light_ctl_server_temperature_status_publish(p_ctl_temperature_srv, &temp_publication_data);
    if (status1 != NRF_SUCCESS)
    {
        return status1;
    }
    return status2;
}

/* Callback used by light lightness module to inform this module when it has done a lightness
 * publish. This is to cover the case where a Light Lightness message was received meaning
 * that CTL should publish since the lightness component of the composite state changed. */
static void add_publish(const void * p_app_v, light_lightness_status_params_t * p_pub_data)
{
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    light_ctl_status_params_t publication_data;
    const app_light_ctl_setup_server_t * p_app = (app_light_ctl_setup_server_t *) p_app_v;

    if (p_app->light_ctl_setup_srv.state.initialized == false)
    {
        /* Ignore any publish before we have finished setting up the CTL server */
        return;
    }

    if (p_app->ctl_state_set_active == false)
    {
        p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
        /* Keeping info from the light lightness mid app for lightness and time - leaving temperature as
         * it is. */
        publication_data.present_lightness = p_pub_data->present_lightness;
        publication_data.target_lightness =  p_pub_data->target_lightness;
        publication_data.remaining_time_ms = p_pub_data->remaining_time_ms;
        publication_data.present_temperature32 = present_ctl_state.temperature32;
        publication_data.target_temperature32 = p_app->state.target_temperature32;

        /* Ignore status, as publish may fail due to several reasons and it is ok. */
        (void) light_ctl_server_status_publish(&p_app->light_ctl_setup_srv.ctl_srv, &publication_data);
    }
    /* else - don't publish anything - if there is a ctl state set command in progress, it will do
     * publish commands that will run in parallel to this */
}

/***** Transition module callback function implementation *****/
/* Note: The task of the transition module is to implement gradual changes of CTL's Temperature and
 * Delta UV states (the lightness mid app handles the lightness gradual changes) for all possible
 * time intervals and step size combinations allowed by the CGL model, and the callbacks from
 * this module are used to implement actual temperature and delta UV changes.
 *
 * If you need to implement transitions using external hardware or other mechanisms you can use
 * individual callbacks to initiate specific actions on external hardware.
 */

static app_light_ctl_setup_server_t * transition_to_app(const app_transition_t * p_transition)
{
    app_light_ctl_state_t * p_state;

    p_state = PARENT_BY_FIELD_GET(app_light_ctl_state_t, transition, p_transition);

    return PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t, state, p_state);
}

static void transition_delay_start_cb(const app_transition_t * p_transition)
{
#if NRF_MESH_LOG_ENABLE
    app_light_ctl_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Element %d: starting delay\n",
          p_app->light_ctl_setup_srv.settings.element_index);
#endif
}

static void transition_start_cb(const app_transition_t * p_transition)
{
    app_light_ctl_setup_server_t * p_app;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);

    if ((p_app->state.transition.requested_params.transition_type == APP_CTL_TRANSITION_DELTA_SET &&
        p_app->state.new_tid) ||
        (p_app->state.transition.requested_params.transition_type == APP_CTL_TRANSITION_SET) ||
        (p_app->state.transition.requested_params.transition_type == APP_CTL_TRANSITION_MOVE_SET))
    {
        p_app->state.initial_present_temperature32 = p_app->state.init_present_temp32_snapshot;
        p_app->state.initial_present_delta_uv = p_app->state.init_present_duv_snapshot;
    }
    p_app->state.target_temperature32 = p_app->state.target_temp32_snapshot;
    p_app->state.target_delta_uv = p_app->state.target_duv_snapshot;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Element %d: starting transition: initial-t32: %d delta: %d tt: %d\n",
          p_app->light_ctl_setup_srv.settings.element_index,
          light_ctl_utils_temperature32_to_temperature(p_app->state.initial_present_temperature32),
          p_params->required_delta,
          p_params->transition_time_ms);

    p_app->state.published_ms = 0;

    if (p_app->app_light_ctl_transition_cb != NULL)
    {
        app_light_ctl_temperature_duv_hw_state_t target_ctl_state;
        target_ctl_state.delta_uv = p_app->state.target_delta_uv;
        target_ctl_state.temperature32 = p_app->state.target_temperature32;
        p_app->app_light_ctl_transition_cb(p_app,
                    p_params->transition_time_ms,
                    target_ctl_state);
    }
}

/* 6.1.3.1.3 Binding with the Temperature Range state
 * Light CTL Temperature = Light CTL Range Min for values of the Light CTL Temperature state that
 *   are less than the value of the Light CTL Temperature Range Min state.
 *
 * Light CTL Temperature = Light CTL Temperature Range Max for values of the Light CTL Temperature
 *   state that are greater than the value of the Light CTL Temperature Range Max state
 */
static void present_ctl_values_set(app_light_ctl_setup_server_t * p_app, light_ctl_temperature_range_set_params_t * p_range)
{
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;

    present_ctl_state.temperature32 = p_app->state.present_temperature32;
    present_ctl_state.temperature32 = light_ctl_utils_temperature32_range_restrict(present_ctl_state.temperature32,
                                                                                   p_range->temperature32_range_min,
                                                                                   p_range->temperature32_range_max);

