NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
    present_ctl_state.delta_uv = p_app->state.present_delta_uv;

    if (p_app->app_light_ctl_set_cb != NULL)
    {
        p_app->app_light_ctl_set_cb(p_app, &present_ctl_state);
    }

    p_app->state.present_temperature32 = present_ctl_state.temperature32;
}

static inline bool temperature32_limit_check(uint32_t present_temperature32,
                                             light_ctl_temperature_range_set_params_t * p_range,
                                             int32_t required_delta)
{
    /* Return true, if the present value is at the range limits */
    return ((required_delta > 0 && present_temperature32 == p_range->temperature32_range_max) ||
            (required_delta < 0 && present_temperature32 == p_range->temperature32_range_min));
}

static bool m_transition_abort_flag_cb(void)
{
    LIST_FOREACH(p_iter, mp_app_light_ctl_head)
    {
        app_light_ctl_setup_server_t * p_app = PARENT_BY_FIELD_GET(app_light_ctl_setup_server_t,
                                                                   node,
                                                                   p_iter);
        if (p_app->abort_move)
        {
            p_app->abort_move = false;
            app_transition_abort(&p_app->state.transition);
        }
    }
    return true;
}

static void transition_tick_cb(const app_transition_t * p_transition)
{
    uint32_t elapsed_ms;
    uint32_t remaining_ms;
    app_light_ctl_setup_server_t * p_app;
    int64_t delta_temperature32;
    int32_t delta_duv;
    int32_t total_time_ms;
    light_ctl_temperature_range_set_params_t range_set;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    /* Putting the uint32_t into an int32 for signed integer division.  No data is lost since in
     * @tagMeshMdlSp section 3.1.3 gives the maximum transition time of 10.5 hours (that is < 38
     * million ms, which is well below 31 bits) */
    total_time_ms = p_params->transition_time_ms;
    elapsed_ms = app_transition_elapsed_time_get((app_transition_t *)p_transition);
    remaining_ms = total_time_ms - elapsed_ms;

    if (p_params->transition_type != APP_CTL_TRANSITION_MOVE_SET)
    {
        /* Lightness is handled in the other state machine */
        /* Calculate new values using linear interpolation and provide to the application. */
        delta_temperature32 =
            ((int64_t)p_app->state.target_temperature32 - (int64_t)p_app->state.initial_present_temperature32);
        p_app->state.present_temperature32 = p_app->state.initial_present_temperature32 +
            ((int64_t)delta_temperature32 * (int64_t)elapsed_ms / total_time_ms);

        delta_duv = (p_app->state.target_delta_uv - p_app->state.initial_present_delta_uv);
        p_app->state.present_delta_uv = p_app->state.initial_present_delta_uv +
            ((int64_t)delta_duv * (int64_t)elapsed_ms / total_time_ms);
    }
    else
    {
        /* A move command only comes from a level client, which is only bound to the temperature
         * state, not the delta UV state */
        delta_temperature32 = SCALE_UP((int64_t)p_params->required_delta, T32_SCALE_FACTOR);
        p_app->state.present_temperature32 = p_app->state.initial_present_temperature32 +
            (((int64_t)elapsed_ms * delta_temperature32) / (int64_t)p_params->transition_time_ms);
    }

    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_app->light_ctl_setup_srv.state.handle, &range_set));
    /* The CTL server can't function if the temperature is unknown - check for unknown value */
    CHECK_INVALID_TEMPERATURE_RANGE(range_set);
    present_ctl_values_set(p_app, &range_set);

    if (p_params->transition_type == APP_CTL_TRANSITION_MOVE_SET &&
        temperature32_limit_check(p_app->state.present_temperature32, &range_set, p_params->required_delta))
    {
        /* Stop transition on the temperature/delta_uv FSM */
        p_app->abort_move = true;
        bearer_event_flag_set(m_transition_abort_flag);
    }

    /* While the transition has at least one half second remaining, publish intermediate CTL state
     * at one second intervals. */
    if ((remaining_ms > CTL_ADDITIONAL_PUBLISH_START_MARGIN_MS) &&
        (elapsed_ms - p_app->state.published_ms > CTL_ADDITIONAL_PUBLISH_INTERVAL_MS))
    {
        p_app->state.published_ms = elapsed_ms;
        /* Ignore status, as publish may fail due to several reasons and it is ok. */
        (void) ctl_publish(p_app, remaining_ms);
    }
}

static void transition_complete_cb(const app_transition_t * p_transition)
{
    app_light_ctl_setup_server_t * p_app;
    light_ctl_temperature_range_set_params_t range_set;

    p_app = transition_to_app(p_transition);
    app_transition_params_t * p_params = app_transition_ongoing_get(&p_app->state.transition);

    p_app->state.target_temperature32 = p_app->state.target_temp32_snapshot;
    p_app->state.target_delta_uv = p_app->state.target_duv_snapshot;

    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Element %d: transition completed\n",
          p_app->light_ctl_setup_srv.settings.element_index);

    if (p_params->transition_type != APP_CTL_TRANSITION_MOVE_SET)
    {
        p_app->state.present_temperature32 = p_app->state.target_temperature32;
        p_app->state.present_delta_uv = p_app->state.target_delta_uv;
    }

    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(p_app->light_ctl_setup_srv.state.handle, &range_set));
    CHECK_INVALID_TEMPERATURE_RANGE(range_set);
    present_ctl_values_set(p_app, &range_set);

    /* The transition is complete */
    if (p_app->app_light_ctl_transition_cb != NULL)
    {
        app_light_ctl_temperature_duv_hw_state_t target_ctl_state;
        target_ctl_state.delta_uv = p_app->state.target_delta_uv;
        target_ctl_state.temperature32 = p_app->state.target_temperature32;
        p_app->app_light_ctl_transition_cb(p_app,
                    p_params->transition_time_ms,
                    target_ctl_state);
    }

