NordicSemiconductor/nRF5-SDK-for-Mesh/examples/common/src/app_light_ctl.c
    ERROR_CHECK(light_ctl_mc_temperature32_state_set(p_app->light_ctl_setup_srv.state.handle, p_app->state.present_temperature32));
    ERROR_CHECK(light_ctl_mc_delta_uv_state_set(p_app->light_ctl_setup_srv.state.handle, p_app->state.present_delta_uv));

    /* Ignore status, as publish may fail due to several reasons and it is ok. */
    (void) ctl_publish(p_app, 0);

    /* If this was a CTL state set, we have completed this CTL state or temperature state set
     * command.  If it wasn't a CTL state or temperature state set, they are already false, so it's
     * perfectly acceptable to set to false */
    p_app->ctl_state_set_active = false;
    p_app->ctl_temperature_state_set_active = false;
}

/* Returns true if the identified transition time is a valid non-zero value;
 * false otherwise.
 */
static void transition_parameters_set(app_light_ctl_setup_server_t * p_app,
                                      int32_t delta,
                                      const model_transition_t * p_in_transition,
                                      app_transition_type_t transition_type)
{
    app_transition_params_t * p_params = app_transition_requested_get(&p_app->state.transition);

    p_params->transition_type = transition_type;
    p_params->required_delta  = delta;
    p_params->minimum_step_ms = TRANSITION_STEP_MIN_MS;

    /* Requirement: If transition time parameters are unavailable and default transition time state
     * is not available, transition shall be instantaneous. */
    if (p_in_transition == NULL)
    {
        p_app->state.transition.delay_ms = 0;

        ERROR_CHECK(light_lightness_mc_dtt_state_get(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                     &p_params->transition_time_ms));
    }
    else
    {
        p_app->state.transition.delay_ms = p_in_transition->delay_ms;
        p_params->transition_time_ms = p_in_transition->transition_time_ms;
    }
}


/***** Interface functions *****/

uint32_t app_light_ctl_model_init(app_light_ctl_setup_server_t * p_app, uint8_t element_index,
                                  app_light_lightness_setup_server_t * p_app_ll)
{
    uint32_t status;

    if (p_app == NULL || p_app_ll == NULL)
    {
        return NRF_ERROR_NULL;
    }

    if ( (p_app->app_light_ctl_get_cb == NULL) ||
         ( (p_app->app_light_ctl_set_cb == NULL) &&
           (p_app->app_light_ctl_transition_cb == NULL) ) )
    {
        return NRF_ERROR_NULL;
    }

    p_app->p_app_ll = p_app_ll;

    /* Set up the added callback from light lightness to CTL */
    p_app->p_app_ll->app_add_notify.p_app_publish_v = p_app;
    p_app->p_app_ll->app_add_notify.app_add_publish_cb = add_publish;

    /* Initialize a CTL setup server.  The main.c code already initialized our light lightness setup
     * server, and the CTL main element is shared with that light lightness server.  The init code
     * uses the p_app to get the model handle for the light lightness server and all its extended
     * servers.
     */
    status = app_ctl_setup_server_init(p_app, element_index);

    if (status != NRF_SUCCESS)
    {
        return status;
    }

    p_app->state.transition.delay_start_cb = transition_delay_start_cb;
    p_app->state.transition.transition_start_cb = transition_start_cb;
    p_app->state.transition.transition_tick_cb = transition_tick_cb;
    p_app->state.transition.transition_complete_cb = transition_complete_cb;
    p_app->state.transition.p_context = &p_app->state.transition;
    p_app->abort_move = false;

    status = app_transition_init(&p_app->state.transition);

    if (status == NRF_SUCCESS)
    {
        list_add(&mp_app_light_ctl_head, &p_app->node);
        m_transition_abort_flag = bearer_event_flag_add(m_transition_abort_flag_cb);
    }

    return status;
}

uint32_t app_light_ctl_binding_setup(app_light_ctl_setup_server_t * p_app)
{
    light_ctl_saved_values_t state;
    uint16_t index;
    uint16_t ll_index;

    if (p_app == NULL)
    {
        return NRF_ERROR_NULL;
    }

    index = p_app->light_ctl_setup_srv.state.handle;
    ll_index = p_app->p_app_ll->light_lightness_setup_server.state.handle;

    ERROR_CHECK(light_lightness_mc_onpowerup_state_get(ll_index, &state.onpowerup));
    ERROR_CHECK(light_ctl_mc_temperature32_state_get(index, &state.temperature32));
    ERROR_CHECK(light_ctl_mc_default_temperature32_state_get(index, &state.default_temperature32));
    ERROR_CHECK(light_ctl_mc_delta_uv_state_get(index, (int16_t *) &state.delta_uv));
    ERROR_CHECK(light_ctl_mc_default_delta_uv_state_get(index, (int16_t *) &state.default_delta_uv));
    ERROR_CHECK(light_ctl_mc_temperature32_range_state_get(index, &state.temperature32_range));

    /* The CTL server can't function if the temperature is unknown - check for unknown value */
    CHECK_INVALID_TEMPERATURE_RANGE(state.temperature32_range);

    return light_ctl_ponoff_binding_setup(&p_app->light_ctl_setup_srv, &state);
}

uint32_t app_light_ctl_current_value_publish(app_light_ctl_setup_server_t * p_app)
{
    app_light_ctl_temperature_duv_hw_state_t present_ctl_state;
    uint16_t lightness;

    if (p_app == NULL)
    {
        return NRF_ERROR_NULL;
    }

    /* Stop any transitions on the temperature/delta_uv FSM and the lightness FSM */
    app_transition_abort(&p_app->state.transition);
    app_transition_abort(&p_app->p_app_ll->state.transition);

    p_app->app_light_ctl_get_cb(p_app, &present_ctl_state);
    p_app->p_app_ll->app_light_lightness_get_cb(p_app->p_app_ll, &lightness);

    p_app->state.present_temperature32 = present_ctl_state.temperature32;
    p_app->state.present_delta_uv = present_ctl_state.delta_uv;
    p_app->p_app_ll->state.present_lightness = lightness;

    /* Set persistent memory for ctl and light lightness */
    ERROR_CHECK(light_ctl_mc_temperature32_state_set(p_app->light_ctl_setup_srv.state.handle, p_app->state.present_temperature32));
    ERROR_CHECK(light_ctl_mc_delta_uv_state_set(p_app->light_ctl_setup_srv.state.handle, p_app->state.present_delta_uv));

    if (lightness >= LIGHT_LIGHTNESS_LAST_MIN)
    {
        ERROR_CHECK(light_lightness_mc_last_state_set(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                    lightness,
                                                    LIGHT_LIGHTNESS_MC_WRITE_DESTINATION_ALL));
    }

    ERROR_CHECK(light_lightness_mc_actual_state_set(p_app->p_app_ll->light_lightness_setup_server.state.handle,
                                                  lightness));

    return ctl_publish(p_app, 0);
}
